In [3]:
# 1. gapminder.tsv파일을 읽고 다음 작업을 진행하시오
# (read_csv를 사용하되, sep=\t로 설정하여 읽을 것)

import pandas as pd
df=pd.read_csv('pandas_data/gapminder.tsv',sep='\t')
df.head()

       country continent  year  lifeExp       pop   gdpPercap
0  Afghanistan      Asia  1952   28.801   8425333  779.445314
1  Afghanistan      Asia  1957   30.332   9240934  820.853030
2  Afghanistan      Asia  1962   31.997  10267083  853.100710
3  Afghanistan      Asia  1967   34.020  11537966  836.197138
4  Afghanistan      Asia  1972   36.088  13079460  739.981106

In [4]:
# -자료 크기, 차원, 컬럼, 타입 등 읽어들인 자료의 구조를 확인하시오
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1704 entries, 0 to 1703
Data columns (total 6 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   country    1704 non-null   object
 1   continent  1704 non-null   object
 2   year       1704 non-null   int64
 3   lifeExp    1704 non-null   float64
 4   pop        1704 non-null   int64
 5   gdpPercap  1704 non-null   float64
dtypes: float64(2), int64(2), object(2)
memory usage: 80.0+ KB

In [7]:
# -국가명, 대륙명, 연도 열을 추출하시오
df['country']
df['continent']
df['year']

0       1952
1       1957
2       1962
3       1967
4       1972
        ...
1699    1987
1700    1992
1701    1997
1702    2002
1703    2007
Name: year, Length: 1704, dtype: int64

In [23]:
# -lifeExp(기대수명),pop(인구),gdp(소득)의 최대/최소/평균/표준편차
df['lifeExp'].max()
df['lifeExp'].describe()
df.describe()

             year      lifeExp           pop      gdpPercap
count  1704.00000  1704.000000  1.704000e+03    1704.000000
mean   1979.50000    59.474439  2.960121e+07    7215.327081
std      17.26533    12.917107  1.061579e+08    9857.454543
min    1952.00000    23.599000  6.001100e+04     241.165876
25%    1965.75000    48.198000  2.793664e+06    1202.060309
50%    1979.50000    60.712500  7.023596e+06    3531.846988
75%    1993.25000    70.845500  1.958522e+07    9325.462346
max    2007.00000    82.603000  1.318683e+09  113523.132900

In [30]:
# 2. 다음 조건을 만족하는 임의의 데이터프레임을 하나 만든다.
# (1) 열의 갯수와 행의 갯수가 각각 5개 이상이어야 한다.
# (2) 열에는 정수, 문자열, 실수 자료형 데이터가 각각 1개 이상씩 포함되어 있어야 한다.
# -> NaN, 컬럼/행 index지정 등 연습
data = {
    "2015": [9904312, 3448737, 2890451, 2466052,2463553],
    "2010": [9631482, 3393191, 2632035, 2431774,3512547],
    "2005": [9762546, 3512547, 2517680, 2456016,3448737],
    "2000": [9853972, 3655437, 2466338, 2473990,2466338],
    "지역": ["수도권", "경상권", "수도권", "경상권","수도권"],
}
columns = ["지역", "2015", "2010", "2005", "2000"]
idx = ["서울", "부산", "인천", "대구","수원"]
df1=pd.DataFrame(data,index=idx,columns=columns)
df1['2005-2010 증가율']= ((df1['2010']-df1['2005'])/df1['2005']*100).round(2)
df1.info()

<class 'pandas.core.frame.DataFrame'>
Index: 5 entries, 서울 to 수원
Data columns (total 6 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   지역             5 non-null      object
 1   2015           5 non-null      int64
 2   2010           5 non-null      int64
 3   2005           5 non-null      int64
 4   2000           5 non-null      int64
 5   2005-2010 증가율  5 non-null      float64
dtypes: float64(1), int64(4), object(1)
memory usage: 280.0+ bytes

In [31]:
df1

     지역     2015     2010     2005     2000  2005-2010 증가율
서울  수도권  9904312  9631482  9762546  9853972          -1.34
부산  경상권  3448737  3393191  3512547  3655437          -3.40
인천  수도권  2890451  2632035  2517680  2466338           4.54
대구  경상권  2466052  2431774  2456016  2473990          -0.99
수원  수도권  2463553  3512547  3448737  2466338           1.85

In [32]:
#수원의 2010년도 인구수를 추출하자
df1['2010']['수원']

3512547

In [33]:
# 2000년도 지역별 인구수를 추출하자
df1[['2000']]

       2000
서울  9853972
부산  3655437
인천  2466338
대구  2473990
수원  2466338

In [35]:
# 3. 다음 데이터프레임에서 지정하는 데이터를 뽑아내거나 처리하라.

data = {
    "국어": [80, 90, 70, 30],
    "영어": [90, 70, 60, 40],
    "수학": [90, 60, 80, 70],
}
columns = ["국어", "영어", "수학"]
index = ["춘향", "몽룡", "향단", "방자"]
df = pd.DataFrame(data, index=index, columns=columns)
df

    국어  영어  수학
춘향  80  90  90
몽룡  90  70  60
향단  70  60  80
방자  30  40  70

In [36]:
# (1) 모든 학생의 수학 점수를 시리즈로 나타낸다.
df['수학']

춘향    90
몽룡    60
향단    80
방자    70
Name: 수학, dtype: int64

In [37]:
# (2) 모든 학생의 국어와 영어 점수를 데이터 프레임으로 나타낸다.
df[['국어','영어']]

    국어  영어
춘향  80  90
몽룡  90  70
향단  70  60
방자  30  40

In [40]:
# (3) 모든 학생의 각 과목 평균 점수를 새로운 열로 추가한다.
df['평균']=(df['국어']+df['영어']+df['수학'])/3
df

    국어  영어  수학         평균
춘향  80  90  90  86.666667
몽룡  90  70  60  73.333333
향단  70  60  80  70.000000
방자  30  40  70  46.666667

In [47]:
# (4) 방자의 영어 점수를 80점으로 수정하고 평균 점수도 다시 계산한다.
df[['영어']]['방자']=80
df['평균']=(df['국어']+df['영어']+df['수학'])/3
df

<ipython-input-47-a3a0bbb07a16>:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df[['영어']]['방자']=80

    국어  영어  수학         평균
춘향  80  90  90  86.666667
몽룡  90  70  60  73.333333
향단  70  60  80  70.000000
방자  30  80  70  60.000000

In [51]:
# (5) 춘향의 점수를 데이터프레임으로 나타낸다.
df[:'춘향']

    국어  영어  수학         평균
춘향  80  90  90  86.666667

In [72]:
# (6) 향단의 점수를 시리즈로 나타낸다.
df.T['향단']

국어    70.0
영어    60.0
수학    80.0
평균    70.0
Name: 향단, dtype: float64

In [74]:
# 4. 
# 제공된 파일중 scientists.csv 파일을 읽고, 다음 작업을 진행하시오
df=pd.read_csv('pandas_data/scientists.csv')
df.head()

                   Name        Born        Died  Age    Occupation
0     Rosaline Franklin  1920-07-25  1958-04-16   37       Chemist
1        William Gosset  1876-06-13  1937-10-16   61  Statistician
2  Florence Nightingale  1820-05-12  1910-08-13   90         Nurse
3           Marie Curie  1867-11-07  1934-07-04   66       Chemist
4         Rachel Carson  1907-05-27  1964-04-14   56     Biologist

In [75]:
# -나이 최대값
df['Age'].max()

90

In [76]:
# -나이 평균
df['Age'].mean()

59.125

In [77]:
# -나이 평균보다 큰 나이 값을 모두 출력
df[df['Age']>df['Age'].mean()]

                   Name        Born        Died  Age     Occupation
1        William Gosset  1876-06-13  1937-10-16   61   Statistician
2  Florence Nightingale  1820-05-12  1910-08-13   90          Nurse
3           Marie Curie  1867-11-07  1934-07-04   66        Chemist
7          Johann Gauss  1777-04-30  1855-02-23   77  Mathematician

In [78]:
# -나이에 2를 곱한 값으로 'ages2' 열 추가
df['ages2']=df['Age']*2
df